gauthig/firefly-touch/sdkconfig.defaults
# ESP32-S3-WROOM-1-N16R8 (16 MB quad flash, 8 MB octal PSRAM)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Single factory-app partition table (see partitions.csv). Firmware updates
# are USB-flashed only — no OTA.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Octal PSRAM @ 80 MHz; keep flash/rodata fetch from PSRAM to reduce RGB LCD
# underrun/flicker (per Espressif RGB-panel app note / Waveshare demo).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# RGB LCD driver
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y
CONFIG_LCD_RGB_RESTART_IN_VSYNC=n

# TWAI
CONFIG_TWAI_ISR_IN_IRAM=y

# Bluetooth (Bluedroid) -- battery-monitor BLE client on bedroom_remote,
# WiFi (ESP-NOW) coexistence handled by IDF's software coexistence manager
# (default on when both esp_wifi and bt are enabled). Bluedroid rather than
# NimBLE per explicit project decision -- BT_BLE_ENABLED/BT_GATTC_ENABLE
# default to y once Bluedroid is on.
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# LVGL 9
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y

# LVGL heap. The Kconfig default is 64 KB and cannot grow
# (LV_MEM_POOL_EXPAND_SIZE is 0), which main_cabinet's four screens overrun:
# measured 78 KB just to build the UI and an 88 KB peak while rendering. The
# panel still booted -- much of the cost is incurred lazily as each screen is
# first drawn -- and then wedged after ~7 nav-rail taps, with LVGL's renderer
# spinning forever on a failed allocation rather than failing cleanly. Because
# esp_lvgl_port holds its lock across all of lv_timer_handler(), that also
# blocked the ESP-NOW rx task and blanked the battery/shore readouts, so it
# presented as three unrelated faults.
# 128 KB leaves ~40 KB over the measured peak. Verified in the simulator with
# its allocator switched to match this one -- see docs/SYSTEM.md.
CONFIG_LV_MEM_SIZE_KILOBYTES=128
